MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F4012/mcu.h
#define _C1INTF_TXWARN_POSITION                  0x0000000A
#define _C1INTF_TXWARN_MASK                      0x00000400
#define _C1INTF_TXWARN_LENGTH                    0x00000001

#define _C1INTF_RXBP_POSITION                    0x0000000B
#define _C1INTF_RXBP_MASK                        0x00000800
#define _C1INTF_RXBP_LENGTH                      0x00000001

#define _C1INTF_TXBP_POSITION                    0x0000000C
#define _C1INTF_TXBP_MASK                        0x00001000
#define _C1INTF_TXBP_LENGTH                      0x00000001

#define _C1INTF_TXBO_POSITION                    0x0000000D
#define _C1INTF_TXBO_MASK                        0x00002000
#define _C1INTF_TXBO_LENGTH                      0x00000001

#define _C1INTF_RXB1OVFL_POSITION                0x0000000E
#define _C1INTF_RXB1OVFL_MASK                    0x00004000
#define _C1INTF_RXB1OVFL_LENGTH                  0x00000001

#define _C1INTF_RXB0OVFL_POSITION                0x0000000F
#define _C1INTF_RXB0OVFL_MASK                    0x00008000
#define _C1INTF_RXB0OVFL_LENGTH                  0x00000001

#define _C1INTF_RX0IF_POSITION                   0x00000000
#define _C1INTF_RX0IF_MASK                       0x00000001
#define _C1INTF_RX0IF_LENGTH                     0x00000001

#define _C1INTF_RX1IF_POSITION                   0x00000001
#define _C1INTF_RX1IF_MASK                       0x00000002
#define _C1INTF_RX1IF_LENGTH                     0x00000001

#define _C1INTF_TX0IF_POSITION                   0x00000002
#define _C1INTF_TX0IF_MASK                       0x00000004
#define _C1INTF_TX0IF_LENGTH                     0x00000001

#define _C1INTF_TX1IF_POSITION                   0x00000003
#define _C1INTF_TX1IF_MASK                       0x00000008
#define _C1INTF_TX1IF_LENGTH                     0x00000001

#define _C1INTF_TX2IF_POSITION                   0x00000004
#define _C1INTF_TX2IF_MASK                       0x00000010
#define _C1INTF_TX2IF_LENGTH                     0x00000001

#define _C1INTF_IVRIF_POSITION                   0x00000007
#define _C1INTF_IVRIF_MASK                       0x00000080
#define _C1INTF_IVRIF_LENGTH                     0x00000001

#define _C1INTF_RXWAR_POSITION                   0x00000009
#define _C1INTF_RXWAR_MASK                       0x00000200
#define _C1INTF_RXWAR_LENGTH                     0x00000001

#define _C1INTF_TXWAR_POSITION                   0x0000000A
#define _C1INTF_TXWAR_MASK                       0x00000400
#define _C1INTF_TXWAR_LENGTH                     0x00000001

#define _C1INTF_RXEP_POSITION                    0x0000000B
#define _C1INTF_RXEP_MASK                        0x00000800
#define _C1INTF_RXEP_LENGTH                      0x00000001

#define _C1INTF_TXEP_POSITION                    0x0000000C
#define _C1INTF_TXEP_MASK                        0x00001000
#define _C1INTF_TXEP_LENGTH                      0x00000001

#define _C1INTF_RX1OVR_POSITION                  0x0000000E
#define _C1INTF_RX1OVR_MASK                      0x00004000
#define _C1INTF_RX1OVR_LENGTH                    0x00000001

#define _C1INTF_RX0OVR_POSITION                  0x0000000F
#define _C1INTF_RX0OVR_MASK                      0x00008000
#define _C1INTF_RX0OVR_LENGTH                    0x00000001

#define _C1INTE_RXB0IE_POSITION                  0x00000000
#define _C1INTE_RXB0IE_MASK                      0x00000001
#define _C1INTE_RXB0IE_LENGTH                    0x00000001

#define _C1INTE_RXB1IE_POSITION                  0x00000001
#define _C1INTE_RXB1IE_MASK                      0x00000002
#define _C1INTE_RXB1IE_LENGTH                    0x00000001

#define _C1INTE_TXB0IE_POSITION                  0x00000002
#define _C1INTE_TXB0IE_MASK                      0x00000004
#define _C1INTE_TXB0IE_LENGTH                    0x00000001

#define _C1INTE_TXB1IE_POSITION                  0x00000003
#define _C1INTE_TXB1IE_MASK                      0x00000008
#define _C1INTE_TXB1IE_LENGTH                    0x00000001

#define _C1INTE_TXB2IE_POSITION                  0x00000004
#define _C1INTE_TXB2IE_MASK                      0x00000010
#define _C1INTE_TXB2IE_LENGTH                    0x00000001

#define _C1INTE_ERRIE_POSITION                   0x00000005
#define _C1INTE_ERRIE_MASK                       0x00000020
#define _C1INTE_ERRIE_LENGTH                     0x00000001

#define _C1INTE_WAKIE_POSITION                   0x00000006
#define _C1INTE_WAKIE_MASK                       0x00000040
#define _C1INTE_WAKIE_LENGTH                     0x00000001

#define _C1INTE_IRXIE_POSITION                   0x00000007
#define _C1INTE_IRXIE_MASK                       0x00000080
#define _C1INTE_IRXIE_LENGTH                     0x00000001

#define _C1INTE_RX0IE_POSITION                   0x00000000
#define _C1INTE_RX0IE_MASK                       0x00000001
#define _C1INTE_RX0IE_LENGTH                     0x00000001

#define _C1INTE_RX1IE_POSITION                   0x00000001
#define _C1INTE_RX1IE_MASK                       0x00000002
#define _C1INTE_RX1IE_LENGTH                     0x00000001

#define _C1INTE_TX0IE_POSITION                   0x00000002
#define _C1INTE_TX0IE_MASK                       0x00000004
#define _C1INTE_TX0IE_LENGTH                     0x00000001

#define _C1INTE_TX1IE_POSITION                   0x00000003
#define _C1INTE_TX1IE_MASK                       0x00000008
#define _C1INTE_TX1IE_LENGTH                     0x00000001

#define _C1INTE_TX2IE_POSITION                   0x00000004
#define _C1INTE_TX2IE_MASK                       0x00000010
#define _C1INTE_TX2IE_LENGTH                     0x00000001

#define _C1INTE_IVRIE_POSITION                   0x00000007
#define _C1INTE_IVRIE_MASK                       0x00000080
#define _C1INTE_IVRIE_LENGTH                     0x00000001

#define _C1EC_REC0_POSITION                      0x00000000
#define _C1EC_REC0_MASK                          0x00000001
#define _C1EC_REC0_LENGTH                        0x00000001

#define _C1EC_REC1_POSITION                      0x00000001
#define _C1EC_REC1_MASK                          0x00000002
#define _C1EC_REC1_LENGTH                        0x00000001

#define _C1EC_REC2_POSITION                      0x00000002
#define _C1EC_REC2_MASK                          0x00000004
#define _C1EC_REC2_LENGTH                        0x00000001

#define _C1EC_REC3_POSITION                      0x00000003
#define _C1EC_REC3_MASK                          0x00000008
#define _C1EC_REC3_LENGTH                        0x00000001

#define _C1EC_REC4_POSITION                      0x00000004
#define _C1EC_REC4_MASK                          0x00000010
#define _C1EC_REC4_LENGTH                        0x00000001

#define _C1EC_REC5_POSITION                      0x00000005
#define _C1EC_REC5_MASK                          0x00000020
#define _C1EC_REC5_LENGTH                        0x00000001

#define _C1EC_REC6_POSITION                      0x00000006
#define _C1EC_REC6_MASK                          0x00000040
#define _C1EC_REC6_LENGTH                        0x00000001

#define _C1EC_REC7_POSITION                      0x00000007
#define _C1EC_REC7_MASK                          0x00000080
#define _C1EC_REC7_LENGTH                        0x00000001

