MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F4012/mcu.h
/*
** Only one invocation of FUID0 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FUID0.
** Multiple options may be combined, as shown:
**
** _FUID0( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   :
**
*/


/* Register FUID1 (0x8005c2)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FUID1;
#define _FUID1(x) __attribute__((address(0x8005c2),deprecated_definition("consider migrating to #pragma config"),section("__FUID1.sec"),space(prog))) __prog__ uint16_t _FUID1 = (x);

/*
** Only one invocation of FUID1 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FUID1.
** Multiple options may be combined, as shown:
**
** _FUID1( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   :
**
*/


/* Register FUID2 (0x8005c4)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FUID2;
#define _FUID2(x) __attribute__((address(0x8005c4),deprecated_definition("consider migrating to #pragma config"),section("__FUID2.sec"),space(prog))) __prog__ uint16_t _FUID2 = (x);

/*
** Only one invocation of FUID2 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FUID2.
** Multiple options may be combined, as shown:
**
** _FUID2( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   :
**
*/


/* Register FUID3 (0x8005c6)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FUID3;
#define _FUID3(x) __attribute__((address(0x8005c6),deprecated_definition("consider migrating to #pragma config"),section("__FUID3.sec"),space(prog))) __prog__ uint16_t _FUID3 = (x);

/*
** Only one invocation of FUID3 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FUID3.
** Multiple options may be combined, as shown:
**
** _FUID3( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   :
**
*/


/* Register FOSC (0xf80000)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FOSC;
#define _FOSC(x) __attribute__((address(0xf80000),deprecated_definition("consider migrating to #pragma config"),section("__FOSC.sec"),space(prog))) __prog__ uint16_t _FOSC = (x);

/*
** Only one invocation of FOSC should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FOSC.
** Multiple options may be combined, as shown:
**
** _FOSC( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Primary Oscillator Mode:
**     XTL                  XTL
**     FRC_PLL4             FRC w/ PLL 4x
**     HS                   HS
**     FRC_PLL16            FRC w/ PLL 16x
**     XT                   XT
**     XT_PLL4              XT w/PLL 4x
**     XT_PLL8              XT w/PLL 8x
**     XT_PLL16             XT w/PLL 16x
**     ERCIO                ERCIO
**     ERC                  ERC
**     FRC_PLL8             FRC w/ PLL 8x
**     EC                   EC
**     ECIO                 ECIO
**     ECIO_PLL4            ECIO w/ PLL 4x
**     EC_PLL4              ECIO w/ PLL 4x
**     ECIO_PLL8            ECIO w/ PLL 8x
**     EC_PLL8              ECIO w/ PLL 8x
**     ECIO_PLL16           ECIO w/ PLL 16x
**     EC_PLL16             ECIO w/ PLL 16x
**
**   Oscillator Source:
**     LPOSC                Low-Power 32KHz Osc <TMR1 Osc>
**     LP                   Low-Power 32KHz Osc <TMR1 Osc>
**     FRC                  Internal Fast RC
**     LPRC                 Internal Low-Power RC
**     PRI                  Primary Oscillator
**
**   Clock Switching and Monitor:
**     CSW_FSCM_ON          Sw Enabled, Mon Enabled
**     CSW_ON_FSCM_OFF      Sw Enabled, Mon Disabled
**     CSW_FSCM_OFF         Sw Disabled, Mon Disabled
**
*/

#define XTL                  0xC300
#define FRC_PLL4             0xC301
#define HS                   0xC302
#define FRC_PLL16            0xC303
#define XT                   0xC304
#define XT_PLL4              0xC305
#define XT_PLL8              0xC306
#define XT_PLL16             0xC307
#define ERCIO                0xC308
#define ERC                  0xC309
#define FRC_PLL8             0xC30A
#define EC                   0xC30B
#define ECIO                 0xC30C
#define ECIO_PLL4            0xC30D
#define EC_PLL4              0xC30D
#define ECIO_PLL8            0xC30E
#define EC_PLL8              0xC30E
#define ECIO_PLL16           0xC30F
#define EC_PLL16             0xC30F

#define LPOSC                0xC00F
#define LP                   0xC00F
#define FRC                  0xC10F
#define LPRC                 0xC20F
#define PRI                  0xC30F

#define CSW_FSCM_ON          0x030F
#define CSW_ON_FSCM_OFF      0x430F
#define CSW_FSCM_OFF         0x830F

/* Register FWDT (0xf80002)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FWDT;
#define _FWDT(x) __attribute__((address(0xf80002),deprecated_definition("consider migrating to #pragma config"),section("__FWDT.sec"),space(prog))) __prog__ uint16_t _FWDT = (x);

/*
** Only one invocation of FWDT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FWDT.
** Multiple options may be combined, as shown:
**
** _FWDT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   WDT Prescaler B:
**     WDTPSB_1             1:1
**     WDTPSB_2             1:2
**     WDTPSB_3             1:3
**     WDTPSB_4             1:4
**     WDTPSB_5             1:5
**     WDTPSB_6             1:6
**     WDTPSB_7             1:7
**     WDTPSB_8             1:8
**     WDTPSB_9             1:9
**     WDTPSB_10            1:10
**     WDTPSB_11            1:11
**     WDTPSB_12            1:12
**     WDTPSB_13            1:13
**     WDTPSB_14            1:14
**     WDTPSB_15            1:15
**     WDTPSB_16            1:16
**
**   WDT Prescaler A:
**     WDTPSA_1             1:1
**     WDTPSA_8             1:8
**     WDTPSA_64            1:64
**     WDTPSA_512           1:512
**
**   Watchdog Timer:
**     WDT_OFF              Disabled
**     WDT_ON               Enabled
**
*/

#define WDTPSB_1             0x8030
#define WDTPSB_2             0x8031
#define WDTPSB_3             0x8032
#define WDTPSB_4             0x8033
#define WDTPSB_5             0x8034
#define WDTPSB_6             0x8035
#define WDTPSB_7             0x8036
#define WDTPSB_8             0x8037
#define WDTPSB_9             0x8038
#define WDTPSB_10            0x8039
#define WDTPSB_11            0x803A
#define WDTPSB_12            0x803B
#define WDTPSB_13            0x803C
#define WDTPSB_14            0x803D
#define WDTPSB_15            0x803E
#define WDTPSB_16            0x803F

#define WDTPSA_1             0x800F
#define WDTPSA_8             0x801F
#define WDTPSA_64            0x802F
#define WDTPSA_512           0x803F

